title: MSHTA calling powershell
status: stable
description: Detection for mshta.exe calling powershell, this is likely used for defense-evasion
references:
    - https://tria.ge/240219-hf6vfaba63/behavioral1
    - https://redcanary.com/threat-detection-report/techniques/mshta/
author: Conrad Fernandes
date: 2024-11-12
tags:
    - attack.defense-evasion
    - attack.t1140
    - attack.t1218.005
    - attack.execution
    - attack.t1059

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentCommandLine|contains: 'mshta.exe'
        CommandLine|contains:
            - 'powershell'
            - 'New-Object System.Net.WebClient'
            - 'FromBase64String'
    condition: selection
falsepositives:
    - FP's could be IT admins or automation scripts used in the environment
level: high
